---
kind: property
id: P:Autodesk.Revit.DB.Solid.Edges
source: html/09baca60-e5ab-eef8-2622-2b956f258c8a.htm
---
# Autodesk.Revit.DB.Solid.Edges Property

The edges that belong to the solid.

## Syntax (C#)
```csharp
public EdgeArray Edges { get; }
```